{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "GRU", "config": {"U_regularizer": null, "input_length": null, "name": "gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 24, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "input_dim": 12, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "batch_input_shape": [null, null, 12]}}]}