{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 25, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.1, "input_dtype": "float32", "batch_input_shape": [null, null, 13], "input_length": null, "dropout_W": 0.1, "activation": "sigmoid", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 13, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "sigmoid", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.1, "dropout_W": 0.1, "input_dim": 25, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 25, "forget_bias_init": "one", "input_length": null}}]}